In [7]:
import pandas as pd # pandas untuk mengolah data tabel

In [15]:
examdata=pd.read_csv('https://raw.githubusercontent.com/Khusnulnr/Python-Pandas/master/Examdata.csv')

In [16]:
examdata.head ()

    Nama Siswa   Matematika  Bahasa Indonesia  Bahasa Inggris
0  Abd. Ghofar           98                88              91
1         Abid           98                88              94
2     Chamdani           83                88              83
3          Edo           96                85              83
4         Maya           98                85              94

In [17]:
iris.tail ()

  Nama Siswa   Matematika  Bahasa Indonesia  Bahasa Inggris
5      Merly          100                88              91
6      Nurul           95                87              91
7    Fadhlah           92                90              91
8     Shinta           94                90              85
9       Abib           94                88              88

In [18]:
examdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Nama Siswa          10 non-null object
 Matematika         10 non-null int64
Bahasa Indonesia    10 non-null int64
Bahasa Inggris      10 non-null int64
dtypes: int64(3), object(1)
memory usage: 448.0+ bytes

In [19]:
examdata.describe()

        Matematika  Bahasa Indonesia  Bahasa Inggris
count    10.000000         10.000000       10.000000
mean     94.800000         87.700000       89.100000
std       4.802777          1.702939        4.148628
min      83.000000         85.000000       83.000000
25%      94.000000         87.250000       85.750000
50%      95.500000         88.000000       91.000000
75%      98.000000         88.000000       91.000000
max     100.000000         90.000000       94.000000

In [25]:
examdata.groupby('Bahasa Indonesia').mean()

                   Matematika  Bahasa Inggris
Bahasa Indonesia
85                       97.0            88.5
87                       95.0            91.0
88                       94.6            89.4
90                       93.0            88.0